// FileTools.h
#pragma once
#include <windows.h>
#include <string.h>
#include <vector>
 
#ifdef UNICODE
#define fstring std::wstring
#else
#define fstring std::string
#endif // !UNICODE
 
/*********************************************************************
功能：文件是否存在（文件/文件夹）
参数：filePath 路径
*********************************************************************/
bool IsFileExist(LPCTSTR filePath);
 
/*********************************************************************
功能：是否是文件夹
参数：filePath 路径
*********************************************************************/
bool IsDir(LPCTSTR filePath);
 
/*********************************************************************
功能：获得path路径（文件夹）下的所有文件名称（不包含路径，包含后缀）
参数：path 路径
*********************************************************************/
void GetFiles(LPCTSTR path, std::vector<fstring>& files);
 
/*********************************************************************
功能：删除目录(需要保证文件夹内的文件没有被占用)
参数：pSrc 路径
*********************************************************************/
int DeleteDir(LPCTSTR pSrc);
 
/*********************************************************************
功能：复制目录
参数：pSrc，原目录名
pDes，目标目录名
bOverLoad, 如果目标存在是否替换(如果为true，会删除原来目录，小心使用)
返回：<0，失败>0，成功
*********************************************************************/
int CopyDir(LPCTSTR pSrc, LPCTSTR pDes, bool bOverLoad = true);
